src/cfe/Catalogs/OData4_Токены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>OData4_Токены</Name>
			<Hierarchical>false</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.OData4_Профили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешТокена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешённыеIP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнегоИспользования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/Catalogs/OData4_Профили.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>OData4_Профили</Name>
			<Hierarchical>false</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РазмерСтраницы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаибольшийTop</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлубинаExpand</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаговApply</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СложностьФильтра</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперацийBatch</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Права</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Операция</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разрешено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИсключённыеПоля</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТабличнаяЧасть</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поле</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтборыОбъектов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выражение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтборыШаблоны</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЗначения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторЗначения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЛимитыЧастоты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Запросов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Секунд</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/CommonModules/OData4_Профили/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Новый токен доступа: «o4_» и 72 символа base32 (RFC 4648, строчные, без выравнивания) из 360 случайных бит.
Функция НовыйТокен() Экспорт
	Возврат "o4_" + СлучайнаяЧасть();
КонецФункции

// 72 символа base32 из 360 случайных бит: три уникальных идентификатора по 30 шестнадцатеричных цифр
// (без цифры версии и цифры варианта).
Функция СлучайнаяЧасть() Экспорт
	Цифры = "";
	Для Номер = 1 По 3 Цикл
		Идентификатор = Новый УникальныйИдентификатор;
		Текст = СтрЗаменить(Строка(Идентификатор), "-", "");
		Цифры = Цифры + Лев(Текст, 12) + Сред(Текст, 14, 3) + Сред(Текст, 18);
	КонецЦикла;
	Возврат Base32(Цифры);
КонецФункции

// Base32 (RFC 4648, строчные, без выравнивания) шестнадцатеричной строки чётной длины.
Функция Base32(Цифры) Экспорт
	Алфавит = АлфавитBase32();
	Шестнадцатеричные = "0123456789abcdef";
	Буфер = 0;
	Битов = 0;
	Результат = "";
	Для Позиция = 1 По СтрДлина(Цифры) Цикл
		Буфер = Буфер * 16 + СтрНайти(Шестнадцатеричные, НРег(Сред(Цифры, Позиция, 1))) - 1;
		Битов = Битов + 4;
		Если Битов >= 5 Тогда
			Делитель = Pow(2, Битов - 5);
			Индекс = Цел(Буфер / Делитель);
			Результат = Результат + Сред(Алфавит, Индекс + 1, 1);
			Буфер = Буфер - Индекс * Делитель;
			Битов = Битов - 5;
		КонецЕсли;
	КонецЦикла;
	Если Битов > 0 Тогда
		Результат = Результат + Сред(Алфавит, Буфер * Pow(2, 5 - Битов) + 1, 1);
	КонецЕсли;
	Возврат Результат;
КонецФункции

// SHA-256 строки в UTF-8 без BOM: 64 строчные шестнадцатеричные цифры.
Функция ХешТокена(Токен) Экспорт
	Хеширование = Новый ХешированиеДанных(ХешФункция.SHA256);
	Хеширование.Добавить(Токен);
	Возврат НРег(СтрЗаменить(Строка(Хеширование.ХешСумма), " ", ""));
КонецФункции

// Токен имеет формат НовыйТокен(): «o4_» и 72 символа алфавита base32.
Функция ФорматТокенаВерен(Токен) Экспорт
	Если ТипЗнч(Токен) <> Тип("Строка") Или СтрДлина(Токен) <> 75 Или Лев(Токен, 3) <> "o4_" Тогда
		Возврат Ложь;
	КонецЕсли;
	Возврат ТолькоBase32(Сред(Токен, 4));
КонецФункции

// Строка непуста и состоит только из символов алфавита base32 (строчные a-z, 2-7).
Функция ТолькоBase32(Текст) Экспорт
	Если Текст = "" Тогда
		Возврат Ложь;
	КонецЕсли;
	Алфавит = АлфавитBase32();
	Для Позиция = 1 По СтрДлина(Текст) Цикл
		Если СтрНайти(Алфавит, Сред(Текст, Позиция, 1)) = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	Возврат Истина;
КонецФункции

// Выпускает токен: элемент OData4_Токены с хешем токена (сам токен не хранится и не журналируется).
// СрокДействия — дата окончания (пустая — бессрочный), IP — разрешённые адреса через запятую или перевод строки.
// Возвращает текст токена — показывается один раз.
Функция ВыпуститьТокен(Имя, Профиль, СрокДействия = '00010101', IP = "") Экспорт
	Если Не ЗначениеЗаполнено(Имя) Тогда
		ВызватьИсключение "Не задано имя токена";
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ВызватьИсключение "Не задан профиль токена " + Имя;
	КонецЕсли;
	// Проверки ввода живут здесь, а не только в форме (дефект приёмки 5.3 Д3): токен с непригодным адресом
	// не пустит никого, а токен с прошедшим сроком мёртв сразу.
	Ошибки = OData4_НастройкиСервиса.ОшибкиАдресовIP(?(IP = Неопределено, "", IP));
	Если Ошибки.Количество() > 0 Тогда
		ВызватьИсключение СтрСоединить(Ошибки, Символы.ПС);
	КонецЕсли;
	Если ЗначениеЗаполнено(СрокДействия) И СрокДействия <= ТекущаяДатаСеанса() Тогда
		ВызватьИсключение "Срок действия токена " + Имя + " не в будущем: "
			+ Формат(СрокДействия, "ДЛФ=DT");
	КонецЕсли;
	Токен = НовыйТокен();
	Элемент = Справочники.OData4_Токены.СоздатьЭлемент();
	Элемент.Наименование = Имя;
	Элемент.Профиль = Профиль;
	Элемент.ХешТокена = ХешТокена(Токен);
	Элемент.СрокДействия = ?(СрокДействия = Неопределено, '00010101', СрокДействия);
	Элемент.Активен = Истина;
	Элемент.РазрешённыеIP = ?(IP = Неопределено, "", IP);
	Элемент.Записать();
	Возврат Токен;
КонецФункции

// Продлевает токен: новый срок действия только в будущем, отозванный токен не продлевается (отзыв
// окончателен — решение пользователя). Возвращает текст отказа; пустая строка — срок изменён.
Функция ПродлитьТокен(Токен, НовыйСрок) Экспорт
	Если Не ЗначениеЗаполнено(Токен) Тогда
		Возврат "Не задан токен";
	КонецЕсли;
	Объект0 = Токен.ПолучитьОбъект();
	Если Объект0 = Неопределено Тогда
		Возврат "Токен не найден";
	КонецЕсли;
	Если Не Объект0.Активен Тогда
		Возврат "Токен " + Объект0.Наименование + " отозван: продление не восстанавливает доступ. "
			+ "Выпустите новый токен.";
	КонецЕсли;
	Если Не ЗначениеЗаполнено(НовыйСрок) Тогда
		Возврат "Срок действия токена " + Объект0.Наименование + " не изменён: новая дата не задана.";
	КонецЕсли;
	Если НовыйСрок <= ТекущаяДатаСеанса() Тогда
		Возврат "Срок действия токена " + Объект0.Наименование + " не изменён: дата "
			+ Формат(НовыйСрок, "ДЛФ=DT") + " не в будущем.";
	КонецЕсли;
	Объект0.СрокДействия = НовыйСрок;
	Объект0.Записать();
	Возврат "";
КонецФункции

// Отзывает токен: снимает активность. Возвращает текст итога или отказа.
Функция ОтозватьТокен(Токен) Экспорт
	Если Не ЗначениеЗаполнено(Токен) Тогда
		Возврат "Токен не отозван: токен не выбран";
	КонецЕсли;
	Объект0 = Токен.ПолучитьОбъект();
	Если Объект0 = Неопределено Тогда
		Возврат "Токен не отозван: токен не найден";
	КонецЕсли;
	Объект0.Активен = Ложь;
	Объект0.Записать();
	Возврат "Токен отозван: " + Объект0.Наименование;
КонецФункции

// Описание профиля (ссылка или объект справочника OData4_Профили) — неизменяемая структура:
// Ссылка, Версия (версия данных элемента), Лимиты (РазмерСтраницы, НаибольшийTop, ГлубинаExpand, ШаговApply,
// СложностьФильтра, ОперацийBatch; 0 — без ограничения), Права (объект, вид объектов или «*» → операция →
// Булево), ИсключённыеПоля (полное имя объекта → Поля, ТабличныеЧасти, ПоляТабличныхЧастей), ОтборыОбъектов
// (полное имя → массив текстов $filter), ОтборыШаблоны (реквизит → массив значений), ЛимитыЧастоты (массив
// Запросов, Секунд, Правило), ЕстьОтборы.
Функция Описание(Профиль) Экспорт
	Если ТипЗнч(Профиль) = Тип("СправочникСсылка.OData4_Профили") Тогда
		// На пути запроса хранилище расширения читается только запросом (решение контроллера 5.2).
		Данные = ДанныеПрофиля(Профиль);
		Если Данные = Неопределено Тогда
			ВызватьИсключение "Профиль OData4 не найден";
		КонецЕсли;
	Иначе
		Данные = Профиль;
	КонецЕсли;
	Лимиты = Новый Структура;
	Для Каждого Имя Из СтрРазделить(ИменаЛимитов(), ",") Цикл
		Лимиты.Вставить(Имя, Макс(0, Данные[Имя]));
	КонецЦикла;
	Права = Новый Соответствие;
	Для Каждого СтрокаПрав Из Данные.Права Цикл
		Объект = СокрЛП(СтрокаПрав.Объект);
		Операции = Права.Получить(Объект);
		Если Операции = Неопределено Тогда
			Операции = Новый Соответствие;
			Права.Вставить(Объект, Операции);
		КонецЕсли;
		Операция = СокрЛП(СтрокаПрав.Операция);
		Прежнее = Операции.Получить(Операция);
		// На одном уровне запрет сильнее разрешения.
		Операции.Вставить(Операция, СтрокаПрав.Разрешено И Прежнее <> Ложь);
	КонецЦикла;
	ПраваФикс = Новый Соответствие;
	Для Каждого КлючИЗначение Из Права Цикл
		ПраваФикс.Вставить(КлючИЗначение.Ключ, Новый ФиксированноеСоответствие(КлючИЗначение.Значение));
	КонецЦикла;
	Исключённые = Новый Соответствие;
	Для Каждого СтрокаПоля Из Данные.ИсключённыеПоля Цикл
		Объект = СокрЛП(СтрокаПоля.Объект);
		Описание0 = Исключённые.Получить(Объект);
		Если Описание0 = Неопределено Тогда
			Описание0 = Новый Структура("Поля, ТабличныеЧасти, ПоляТабличныхЧастей", Новый Массив, Новый Массив,
				Новый Соответствие);
			Исключённые.Вставить(Объект, Описание0);
		КонецЕсли;
		ИмяТЧ = СокрЛП(СтрокаПоля.ТабличнаяЧасть);
		Поле = СокрЛП(СтрокаПоля.Поле);
		Если ИмяТЧ = "" Тогда
			Описание0.Поля.Добавить(Поле);
		ИначеЕсли Поле = "" Тогда
			Описание0.ТабличныеЧасти.Добавить(ИмяТЧ);
		Иначе
			ПоляТЧ = Описание0.ПоляТабличныхЧастей.Получить(ИмяТЧ);
			Если ПоляТЧ = Неопределено Тогда
				ПоляТЧ = Новый Массив;
				Описание0.ПоляТабличныхЧастей.Вставить(ИмяТЧ, ПоляТЧ);
			КонецЕсли;
			ПоляТЧ.Добавить(Поле);
		КонецЕсли;
	КонецЦикла;
	ИсключённыеФикс = Новый Соответствие;
	Для Каждого КлючИЗначение Из Исключённые Цикл
		Описание0 = КлючИЗначение.Значение;
		ПоляТЧ = Новый Соответствие;
		Для Каждого Пара Из Описание0.ПоляТабличныхЧастей Цикл
			ПоляТЧ.Вставить(Пара.Ключ, Новый ФиксированныйМассив(Пара.Значение));
		КонецЦикла;
		ИсключённыеФикс.Вставить(КлючИЗначение.Ключ, Новый ФиксированнаяСтруктура("Поля, ТабличныеЧасти, ПоляТабличныхЧастей",
			Новый ФиксированныйМассив(Описание0.Поля), Новый ФиксированныйМассив(Описание0.ТабличныеЧасти),
			Новый ФиксированноеСоответствие(ПоляТЧ)));
	КонецЦикла;
	Отборы = Новый Соответствие;
	Для Каждого СтрокаОтбора Из Данные.ОтборыОбъектов Цикл
		Если СокрЛП(СтрокаОтбора.Выражение) = "" Тогда
			Продолжить;
		КонецЕсли;
		Объект = СокрЛП(СтрокаОтбора.Объект);
		Тексты = Отборы.Получить(Объект);
		Если Тексты = Неопределено Тогда
			Тексты = Новый Массив;
			Отборы.Вставить(Объект, Тексты);
		КонецЕсли;
		Тексты.Добавить(СтрокаОтбора.Выражение);
	КонецЦикла;
	ОтборыФикс = Новый Соответствие;
	Для Каждого КлючИЗначение Из Отборы Цикл
		ОтборыФикс.Вставить(КлючИЗначение.Ключ, Новый ФиксированныйМассив(КлючИЗначение.Значение));
	КонецЦикла;
	Шаблоны = Новый Соответствие;
	Для Каждого СтрокаШаблона Из Данные.ОтборыШаблоны Цикл
		Реквизит = СокрЛП(СтрокаШаблона.Реквизит);
		Значения = Шаблоны.Получить(Реквизит);
		Если Значения = Неопределено Тогда
			Значения = Новый Массив;
			Шаблоны.Вставить(Реквизит, Значения);
		КонецЕсли;
		Значение = ЗначениеШаблона(СтрокаШаблона.ТипЗначения, СтрокаШаблона.ИдентификаторЗначения);
		Если Значение <> Неопределено Тогда
			Значения.Добавить(Значение);
		КонецЕсли;
	КонецЦикла;
	ШаблоныФикс = Новый Соответствие;
	Для Каждого КлючИЗначение Из Шаблоны Цикл
		ШаблоныФикс.Вставить(КлючИЗначение.Ключ, Новый ФиксированныйМассив(КлючИЗначение.Значение));
	КонецЦикла;
	// Правила с одинаковыми N/T — одно ограничение (отзыв безопасности, группа A): ключ счётчика — «N/T», и
	// повтор правила увеличивал общий счётчик дважды за запрос, то есть пропускал только N/2 запросов.
	Частота = Новый Массив;
	КлючиЧастоты = Новый Соответствие;
	Для Каждого СтрокаЧастоты Из Данные.ЛимитыЧастоты Цикл
		Если СтрокаЧастоты.Запросов <= 0 Или СтрокаЧастоты.Секунд <= 0 Тогда
			Продолжить;
		КонецЕсли;
		КлючПравила = Формат(СтрокаЧастоты.Запросов, "ЧН=0; ЧГ=0") + "/" + Формат(СтрокаЧастоты.Секунд, "ЧН=0; ЧГ=0");
		Если КлючиЧастоты.Получить(КлючПравила) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		КлючиЧастоты.Вставить(КлючПравила, Истина);
		Частота.Добавить(Новый ФиксированнаяСтруктура("Запросов, Секунд, Правило", СтрокаЧастоты.Запросов,
			СтрокаЧастоты.Секунд, КлючПравила));
	КонецЦикла;
	Результат = Новый Структура;
	Результат.Вставить("Ссылка", Данные.Ссылка);
	Результат.Вставить("Версия", Данные.ВерсияДанных);
	Результат.Вставить("Лимиты", Новый ФиксированнаяСтруктура(Лимиты));
	Результат.Вставить("Права", Новый ФиксированноеСоответствие(ПраваФикс));
	Результат.Вставить("ИсключённыеПоля", Новый ФиксированноеСоответствие(ИсключённыеФикс));
	Результат.Вставить("ОтборыОбъектов", Новый ФиксированноеСоответствие(ОтборыФикс));
	Результат.Вставить("ОтборыШаблоны", Новый ФиксированноеСоответствие(ШаблоныФикс));
	Результат.Вставить("ЛимитыЧастоты", Новый ФиксированныйМассив(Частота));
	Результат.Вставить("ЕстьОтборы", ОтборыФикс.Количество() > 0 Или ШаблоныФикс.Количество() > 0);
	Возврат Новый ФиксированнаяСтруктура(Результат);
КонецФункции

// Операция разрешена профилем: правило объекта сильнее правила вида объектов, вид — сильнее «*»; на одном
// уровне запрет сильнее разрешения; правила нет ни на одном уровне — запрещено (как в конфигураторе).
// ПолноеИмя — полное имя объекта метаданных («Справочник.Валюты»), Операция — «Чтение», «Добавление», …
Функция Разрешено(Описание, ПолноеИмя, Операция) Экспорт
	Ключи = Новый Массив;
	Ключи.Добавить(ПолноеИмя);
	Точка = СтрНайти(ПолноеИмя, ".");
	Если Точка > 0 Тогда
		Ключи.Добавить(Лев(ПолноеИмя, Точка - 1));
	КонецЕсли;
	Ключи.Добавить("*");
	Для Каждого Ключ Из Ключи Цикл
		Операции = Описание.Права.Получить(Ключ);
		Если Операции = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Значение = Операции.Получить(Операция);
		Если Значение <> Неопределено Тогда
			Возврат Значение;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;
КонецФункции

// Ошибки профиля (ссылка или объект): неизвестные объекты, виды, операции, поля и табличные части, выражения
// отборов, которые не разбираются или не переводятся в условие по полной модели, реквизиты шаблонов, которых нет
// ни у одного опубликованного объекта, неположительные правила частоты, отрицательные лимиты.
// Текст ошибки: «<таблица> строка N: <факт>». Пустой массив — профиль верен.
Функция ПроверитьПрофиль(Профиль) Экспорт
	Ошибки = Новый Массив;
	Если ТипЗнч(Профиль) = Тип("СправочникСсылка.OData4_Профили") Тогда
		Данные = Профиль.ПолучитьОбъект();
		Если Данные = Неопределено Тогда
			Ошибки.Добавить("Профиль не найден");
			Возврат Ошибки;
		КонецЕсли;
	Иначе
		Данные = Профиль;
	КонецЕсли;
	Для Каждого Имя Из СтрРазделить(ИменаЛимитов(), ",") Цикл
		Если Данные[Имя] < 0 Тогда
			Ошибки.Добавить("Лимит " + Имя + " отрицательный: " + Формат(Данные[Имя], "ЧН=0; ЧГ=0"));
		КонецЕсли;
	КонецЦикла;
	Операции = СтрРазделить(ИменаОпераций(), ",");
	Для Каждого СтрокаПрав Из Данные.Права Цикл
		Место = "Права строка " + Формат(СтрокаПрав.НомерСтроки, "ЧГ=0") + ": ";
		Если Не ОбъектИлиВидИзвестен(СокрЛП(СтрокаПрав.Объект)) Тогда
			Ошибки.Добавить(Место + "неизвестный объект " + СтрокаПрав.Объект);
		КонецЕсли;
		Если Операции.Найти(СокрЛП(СтрокаПрав.Операция)) = Неопределено Тогда
			Ошибки.Добавить(Место + "неизвестная операция " + СтрокаПрав.Операция);
		КонецЕсли;
	КонецЦикла;
	Для Каждого СтрокаПоля Из Данные.ИсключённыеПоля Цикл
		Место = "ИсключённыеПоля строка " + Формат(СтрокаПоля.НомерСтроки, "ЧГ=0") + ": ";
		Текст = ОшибкаИсключённогоПоля(СокрЛП(СтрокаПоля.Объект), СокрЛП(СтрокаПоля.ТабличнаяЧасть),
			СокрЛП(СтрокаПоля.Поле));
		Если Текст <> "" Тогда
			Ошибки.Добавить(Место + Текст);
		КонецЕсли;
	КонецЦикла;
	Модель = Неопределено;
	Для Каждого СтрокаОтбора Из Данные.ОтборыОбъектов Цикл
		Место = "ОтборыОбъектов строка " + Формат(СтрокаОтбора.НомерСтроки, "ЧГ=0") + ": ";
		Объект = СокрЛП(СтрокаОтбора.Объект);
		Если ОбъектМетаданных(Объект) = Неопределено Тогда
			Ошибки.Добавить(Место + "неизвестный объект " + СтрокаОтбора.Объект);
			Продолжить;
		КонецЕсли;
		Если Модель = Неопределено Тогда
			Модель = OData4_МодельПовтИсп.ПолнаяМодель();
		КонецЕсли;
		Текст = ОшибкаВыражения(Модель, Объект, СтрокаОтбора.Выражение);
		Если Текст <> "" Тогда
			Ошибки.Добавить(Место + Текст);
		КонецЕсли;
	КонецЦикла;
	МодельЦеликом = Неопределено;
	Для Каждого СтрокаШаблона Из Данные.ОтборыШаблоны Цикл
		Место = "ОтборыШаблоны строка " + Формат(СтрокаШаблона.НомерСтроки, "ЧГ=0") + ": ";
		Если МодельЦеликом = Неопределено Тогда
			// Реквизит ищется во всех наборах: одна временная полная копия ленивой модели сеанса на проверку.
			МодельЦеликом = OData4_Модель.Целиком(OData4_МодельПовтИсп.ПолнаяМодель());
		КонецЕсли;
		Если Не РеквизитОпубликован(МодельЦеликом, СокрЛП(СтрокаШаблона.Реквизит)) Тогда
			Ошибки.Добавить(Место + "реквизита " + СтрокаШаблона.Реквизит + " нет ни у одного опубликованного объекта");
		КонецЕсли;
		Если ЗначениеШаблона(СтрокаШаблона.ТипЗначения, СтрокаШаблона.ИдентификаторЗначения) = Неопределено Тогда
			Ошибки.Добавить(Место + "неверное значение " + СтрокаШаблона.ТипЗначения + " "
				+ СтрокаШаблона.ИдентификаторЗначения);
		КонецЕсли;
	КонецЦикла;
	Для Каждого СтрокаЧастоты Из Данные.ЛимитыЧастоты Цикл
		Место = "ЛимитыЧастоты строка " + Формат(СтрокаЧастоты.НомерСтроки, "ЧГ=0") + ": ";
		Если СтрокаЧастоты.Запросов <= 0 Тогда
			Ошибки.Добавить(Место + "число запросов не больше 0");
		КонецЕсли;
		Если СтрокаЧастоты.Секунд <= 0 Тогда
			Ошибки.Добавить(Место + "число секунд не больше 0");
		КонецЕсли;
	КонецЦикла;
	Возврат Ошибки;
КонецФункции

// Ссылка — значение шаблонного отбора: ТипЗначения — полное имя объекта метаданных («Справочник.Организации»),
// Идентификатор — GUID ссылки строкой. Неверное — Неопределено.
Функция ЗначениеШаблона(ТипЗначения, Идентификатор) Экспорт
	ОбъектМД = ОбъектМетаданных(СокрЛП(ТипЗначения));
	Если ОбъектМД = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	Вид = Лев(ОбъектМД.ПолноеИмя(), СтрНайти(ОбъектМД.ПолноеИмя(), ".") - 1);
	ВидыСсылок = ВидыСсылок();
	ВидСсылки = ВидыСсылок.Получить(Вид);
	Если ВидСсылки = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	Попытка
		Возврат XMLЗначение(Тип(ВидСсылки + "." + ОбъектМД.Имя), СокрЛП(Идентификатор));
	Исключение
		Возврат Неопределено;
	КонецПопытки;
КонецФункции

// Операции матрицы прав.
Функция ИменаОпераций() Экспорт
	Возврат "Чтение,Добавление,Изменение,Удаление,Проведение,ОтменаПроведения,ФизическоеУдаление";
КонецФункции

// Виды объектов матрицы прав («Справочник», …).
Функция ВидыОбъектов() Экспорт
	Возврат "Справочник,Документ,РегистрСведений,РегистрНакопления,РегистрБухгалтерии,РегистрРасчета,ПланСчетов,"
		+ "ПланВидовХарактеристик,ПланВидовРасчета,ПланОбмена,БизнесПроцесс,Задача,Константа,ЖурналДокументов";
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Данные профиля запросом: Структура реквизитов (Ссылка, ВерсияДанных, лимиты) и таблиц значений табличных частей;
// нет профиля — Неопределено.
Функция ДанныеПрофиля(Ссылка)
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	П.Ссылка КАК Ссылка,
	|	П.ВерсияДанных КАК ВерсияДанных,
	|	П.РазмерСтраницы КАК РазмерСтраницы,
	|	П.НаибольшийTop КАК НаибольшийTop,
	|	П.ГлубинаExpand КАК ГлубинаExpand,
	|	П.ШаговApply КАК ШаговApply,
	|	П.СложностьФильтра КАК СложностьФильтра,
	|	П.ОперацийBatch КАК ОперацийBatch
	|ИЗ
	|	Справочник.OData4_Профили КАК П
	|ГДЕ
	|	П.Ссылка = &Ссылка
	|;
	|ВЫБРАТЬ Т.НомерСтроки КАК НомерСтроки, Т.Объект КАК Объект, Т.Операция КАК Операция, Т.Разрешено КАК Разрешено
	|ИЗ Справочник.OData4_Профили.Права КАК Т ГДЕ Т.Ссылка = &Ссылка УПОРЯДОЧИТЬ ПО Т.НомерСтроки
	|;
	|ВЫБРАТЬ Т.НомерСтроки КАК НомерСтроки, Т.Объект КАК Объект, Т.ТабличнаяЧасть КАК ТабличнаяЧасть, Т.Поле КАК Поле
	|ИЗ Справочник.OData4_Профили.ИсключённыеПоля КАК Т ГДЕ Т.Ссылка = &Ссылка УПОРЯДОЧИТЬ ПО Т.НомерСтроки
	|;
	|ВЫБРАТЬ Т.НомерСтроки КАК НомерСтроки, Т.Объект КАК Объект, Т.Выражение КАК Выражение
	|ИЗ Справочник.OData4_Профили.ОтборыОбъектов КАК Т ГДЕ Т.Ссылка = &Ссылка УПОРЯДОЧИТЬ ПО Т.НомерСтроки
	|;
	|ВЫБРАТЬ Т.НомерСтроки КАК НомерСтроки, Т.Реквизит КАК Реквизит, Т.ТипЗначения КАК ТипЗначения,
	|	Т.ИдентификаторЗначения КАК ИдентификаторЗначения
	|ИЗ Справочник.OData4_Профили.ОтборыШаблоны КАК Т ГДЕ Т.Ссылка = &Ссылка УПОРЯДОЧИТЬ ПО Т.НомерСтроки
	|;
	|ВЫБРАТЬ Т.НомерСтроки КАК НомерСтроки, Т.Запросов КАК Запросов, Т.Секунд КАК Секунд
	|ИЗ Справочник.OData4_Профили.ЛимитыЧастоты КАК Т ГДЕ Т.Ссылка = &Ссылка УПОРЯДОЧИТЬ ПО Т.НомерСтроки");
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Пакет = OData4_Хранилище.ВыполнитьПакетЗапроса(Запрос);
	Выборка = Пакет[0].Выбрать();
	Если Не Выборка.Следующий() Тогда
		Возврат Неопределено;
	КонецЕсли;
	Данные = Новый Структура("Ссылка, ВерсияДанных, " + ИменаЛимитов());
	ЗаполнитьЗначенияСвойств(Данные, Выборка);
	Данные.Вставить("Права", Пакет[1].Выгрузить());
	Данные.Вставить("ИсключённыеПоля", Пакет[2].Выгрузить());
	Данные.Вставить("ОтборыОбъектов", Пакет[3].Выгрузить());
	Данные.Вставить("ОтборыШаблоны", Пакет[4].Выгрузить());
	Данные.Вставить("ЛимитыЧастоты", Пакет[5].Выгрузить());
	Возврат Данные;
КонецФункции

Функция АлфавитBase32()
	Возврат "abcdefghijklmnopqrstuvwxyz234567";
КонецФункции

Функция ИменаЛимитов()
	Возврат "РазмерСтраницы,НаибольшийTop,ГлубинаExpand,ШаговApply,СложностьФильтра,ОперацийBatch";
КонецФункции

Функция ВидыСсылок()
	Виды = Новый Соответствие;
	Виды.Вставить("Справочник", "СправочникСсылка");
	Виды.Вставить("Документ", "ДокументСсылка");
	Виды.Вставить("ПланСчетов", "ПланСчетовСсылка");
	Виды.Вставить("ПланВидовХарактеристик", "ПланВидовХарактеристикСсылка");
	Виды.Вставить("ПланВидовРасчета", "ПланВидовРасчетаСсылка");
	Виды.Вставить("ПланОбмена", "ПланОбменаСсылка");
	Виды.Вставить("БизнесПроцесс", "БизнесПроцессСсылка");
	Виды.Вставить("Задача", "ЗадачаСсылка");
	Виды.Вставить("Перечисление", "ПеречислениеСсылка");
	Возврат Виды;
КонецФункции

// Объект метаданных по полному имени вида из ВидыОбъектов (или перечисление); иначе Неопределено.
Функция ОбъектМетаданных(ПолноеИмя)
	Точка = СтрНайти(ПолноеИмя, ".");
	Если Точка = 0 Или СтрНайти(Сред(ПолноеИмя, Точка + 1), ".") > 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	Вид = Лев(ПолноеИмя, Точка - 1);
	Если СтрРазделить(ВидыОбъектов(), ",").Найти(Вид) = Неопределено И Вид <> "Перечисление" Тогда
		Возврат Неопределено;
	КонецЕсли;
	Попытка
		Возврат Метаданные.НайтиПоПолномуИмени(ПолноеИмя);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
КонецФункции

Функция ОбъектИлиВидИзвестен(Имя)
	Если Имя = "*" Или СтрРазделить(ВидыОбъектов(), ",").Найти(Имя) <> Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	Возврат ОбъектМетаданных(Имя) <> Неопределено И Не СтрНачинаетсяС(Имя, "Перечисление.");
КонецФункции

// Текст ошибки строки ИсключённыеПоля или "".
Функция ОшибкаИсключённогоПоля(Объект, ИмяТЧ, Поле)
	ОбъектМетаданных0 = ОбъектМетаданных(Объект);
	Если ОбъектМетаданных0 = Неопределено Или СтрНачинаетсяС(Объект, "Перечисление.") Тогда
		Возврат "неизвестный объект " + Объект;
	КонецЕсли;
	Если ИмяТЧ = "" И Поле = "" Тогда
		Возврат "не заданы ни поле, ни табличная часть";
	КонецЕсли;
	Если ИмяТЧ <> "" Тогда
		ТЧ = ТабличнаяЧастьОбъекта(ОбъектМетаданных0, ИмяТЧ);
		Если ТЧ = Неопределено Тогда
			Возврат "у объекта " + Объект + " нет табличной части " + ИмяТЧ;
		КонецЕсли;
		Если Поле <> "" И Поле <> "НомерСтроки" И ТЧ.Реквизиты.Найти(Поле) = Неопределено Тогда
			Возврат "у табличной части " + Объект + "." + ИмяТЧ + " нет поля " + Поле;
		КонецЕсли;
		Возврат "";
	КонецЕсли;
	Если Не ЕстьПоле(ОбъектМетаданных0, Поле) Тогда
		Возврат "у объекта " + Объект + " нет поля " + Поле;
	КонецЕсли;
	Возврат "";
КонецФункции

Функция ТабличнаяЧастьОбъекта(ОбъектМетаданных0, ИмяТЧ)
	Попытка
		Возврат ОбъектМетаданных0.ТабличныеЧасти.Найти(ИмяТЧ);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
КонецФункции

// У объекта метаданных есть реквизит, измерение, ресурс, графа (журнал документов), стандартный или общий
// реквизит с таким именем.
Функция ЕстьПоле(ОбъектМетаданных0, Поле) Экспорт
	Для Каждого Коллекция Из СтрРазделить("Реквизиты,Измерения,Ресурсы,Графы", ",") Цикл
		Попытка
			Элементы = ОбъектМетаданных0[Коллекция];
		Исключение
			Продолжить;
		КонецПопытки;
		Если Элементы.Найти(Поле) <> Неопределено Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	Попытка
		Стандартные = ОбъектМетаданных0.СтандартныеРеквизиты;
	Исключение
		Стандартные = Новый Массив;
	КонецПопытки;
	Для Каждого Реквизит Из Стандартные Цикл
		Если Реквизит.Имя = Поле Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	ОбщийРеквизит = Метаданные.ОбщиеРеквизиты.Найти(Поле);
	Возврат ОбщийРеквизит <> Неопределено И ОбщийРеквизит.Состав.Найти(ОбъектМетаданных0) <> Неопределено;
КонецФункции

// Текст ошибки выражения отбора объекта или "": разбор и перевод в условие по основному набору объекта
// в полной модели.
Функция ОшибкаВыражения(Модель, Объект, Выражение)
	Набор = OData4_ПрофильМодели.ОсновнойНабор(Модель, Объект);
	Если Набор = Неопределено Тогда
		Возврат "объект " + Объект + " не опубликован";
	КонецЕсли;
	Попытка
		Дерево = OData4_Разбор.РазобратьФильтр(Выражение);
		Контекст = OData4_Генератор.НовыйКонтекст(Модель, Новый Структура, Набор, "Т");
		Контекст.Вставить("БезПрофиля", Истина);
		OData4_Генератор.Условие(Дерево, Контекст);
	Исключение
		Возврат "выражение " + Выражение + ": " + OData4_Сервис.СообщениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	Возврат "";
КонецФункции

// Реквизит с таким полем 1С есть у опубликованного набора модели, построенной целиком (OData4_Модель.Целиком).
Функция РеквизитОпубликован(Модель, Реквизит)
	Для Каждого КлючИЗначение Из Модель.Наборы Цикл
		Для Каждого Свойство Из КлючИЗначение.Значение.Свойства Цикл
			Если Свойство.Поле = Реквизит Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Возврат Ложь;
КонецФункции

#КонецОбласти
